driver-tests/bpelse/assign/VariablePropertyTest/FromToPropertySpecJBI/test/CopyFromToPropBasedTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:from="http://j2ee.netbeans.org/schema/FromSpecSchema">
  <soapenv:Body>
    <from:globalElem>
      <intElem>303</intElem>
      <strElem>Test</strElem>
      <boolElem>true</boolElem>
    </from:globalElem>
  </soapenv:Body>
</soapenv:Envelope>